webservice/SAPwsdl20170831.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZSD_ORDER_AVI_CRUD2>
         <!--Optional:-->
         <FLIGHTDATEIN>2017-07-17</FLIGHTDATEIN>
         <!--Optional:-->
         <FLIGHTDATEOUT>2017-07-21</FLIGHTDATEOUT>
         <!--Optional:-->
         <FLIGHTTIMEIN>14:43:00</FLIGHTTIMEIN>
         <!--Optional:-->
         <FLIGHTTIMEOUT>17:27:00</FLIGHTTIMEOUT>
         <!--Optional:-->
         <ID_AIRCRAFTTYPEOUT>738</ID_AIRCRAFTTYPEOUT>
         <!--Optional:-->
         <ID_AIRPORTCLASS>0</ID_AIRPORTCLASS>
         <!--Optional:-->
         <ID_Aircrafttypein>739</ID_Aircrafttypein>
         <!--Optional:-->
         <ID_FLIGHTCATEGORY>0</ID_FLIGHTCATEGORY>
         <!--Optional:-->
         <ID_FLIGHTTYPE>0</ID_FLIGHTTYPE>
         <!--Optional:-->
         <ID_NOOFFLIGHTIN>R3587</ID_NOOFFLIGHTIN>
         <!--Optional:-->
         <ID_NOOFFLIGHTOUT>R3588</ID_NOOFFLIGHTOUT>
         <!--Optional:-->
         <ID_PLANEOWNER>10000060</ID_PLANEOWNER>
         <!--Optional:-->
         <ID_REGISTRATIONIN>VQBMP</ID_REGISTRATIONIN>
         <!--Optional:-->
         <ID_REGISTRATIONOUT>VQBMZ</ID_REGISTRATIONOUT>
         <!--Optional:-->
         <ID_SALESCONTRACT>40000119</ID_SALESCONTRACT>
         <SALES_ITEMS_IN>
            <!--Zero or more repetitions:-->
             <item>
               <ITM_NUMBER>10</ITM_NUMBER>
               <MATERIAL>900000131</MATERIAL>
               <TARGET_QTY>7</TARGET_QTY>
               <COND_TYPE>ZK01</COND_TYPE>
               <COND_VALUE>10</COND_VALUE>
               <CURRENCY></CURRENCY>
               <ID_AODB>1260825</ID_AODB>
               <ID_TERMINAL>01</ID_TERMINAL>
               <ID_AIRPORT>YKS</ID_AIRPORT>
               <ID_AIRCRAFTCLASS>003</ID_AIRCRAFTCLASS>
            </item>
            <item>
               <ITM_NUMBER>20</ITM_NUMBER>
               <MATERIAL>900000131</MATERIAL>
               <TARGET_QTY>7</TARGET_QTY>
               <COND_TYPE>ZK01</COND_TYPE>
               <COND_VALUE>-10</COND_VALUE>
               <CURRENCY></CURRENCY>
               <ID_AODB>1260824</ID_AODB>
               <ID_TERMINAL>01</ID_TERMINAL>
               <ID_AIRPORT>YKS</ID_AIRPORT>
               <ID_AIRCRAFTCLASS>003</ID_AIRCRAFTCLASS>
            </item>
         </SALES_ITEMS_IN>
         <SERVICEMODE>SO_C</SERVICEMODE>
      </urn:ZSD_ORDER_AVI_CRUD2>
   </soapenv:Body>
</soapenv:Envelope>
